In [3]:
import pandas as pd
import numpy as np
df=pd.DataFrame({'key1':['a','a','b','b','a'],
                'key2':['one','two','one','two','one'],
                'data1':np.random.randn(5),
                'data2':np.random.randn(5)})

In [4]:
df

  key1 key2     data1     data2
0    a  one  2.138524  0.729861
1    a  two  0.036632  0.372006
2    b  one  1.180648  1.291876
3    b  two -1.895196  0.627503
4    a  one -0.276614 -0.268332

In [5]:
grouped=df['data1'].groupby(df['key1'])

In [6]:
grouped

In [7]:
grouped.mean()

key1
a    0.632847
b   -0.357274
Name: data1, dtype: float64

In [8]:
means=df['data1'].groupby([df['key1'],df['key2']]).mean()

In [9]:
means

key1  key2
a     one     0.930955
      two     0.036632
b     one     1.180648
      two    -1.895196
Name: data1, dtype: float64

In [10]:
means.unstack()

key2       one       two
key1
a     0.930955  0.036632
b     1.180648 -1.895196

In [11]:
states=np.array(['Ohio','California','Calfornia','Ohio','Ohio'])

In [12]:
years=np.array([2005,2005,2006,2005,2006])

In [13]:
df['data1'].groupby([states,years]).mean()

Calfornia   2006    1.180648
California  2005    0.036632
Ohio        2005    0.121664
            2006   -0.276614
Name: data1, dtype: float64

In [14]:
means.unstack()

key2       one       two
key1
a     0.930955  0.036632
b     1.180648 -1.895196

In [15]:
states=np.array(['Ohio','California','California','Ohio','Ohio'])

In [16]:
years=np.array([2005,2005,2006,2005,2006])

In [17]:
df['data1'].groupby([states,years]).mean()

California  2005    0.036632
            2006    1.180648
Ohio        2005    0.121664
            2006   -0.276614
Name: data1, dtype: float64

In [18]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.632847  0.277845
b    -0.357274  0.959689

In [19]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one   0.930955  0.230764
     two   0.036632  0.372006
b    one   1.180648  1.291876
     two  -1.895196  0.627503

In [20]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [22]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  2.138524  0.729861
1    a  two  0.036632  0.372006
4    a  one -0.276614 -0.268332
b
  key1 key2     data1     data2
2    b  one  1.180648  1.291876
3    b  two -1.895196  0.627503

In [23]:
for (k1,k2),group in df.groupby(['key1','key2']):
    print((k1,k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  2.138524  0.729861
4    a  one -0.276614 -0.268332
('a', 'two')
  key1 key2     data1     data2
1    a  two  0.036632  0.372006
('b', 'one')
  key1 key2     data1     data2
2    b  one  1.180648  1.291876
('b', 'two')
  key1 key2     data1     data2
3    b  two -1.895196  0.627503

In [24]:
pieces=dict(list(df.groupby('key1')))

In [25]:
pieces['b']

  key1 key2     data1     data2
2    b  one  1.180648  1.291876
3    b  two -1.895196  0.627503

In [26]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [27]:
grouped=df.groupby(df.dtypes,axis=1)

In [29]:
for dtype,group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0  2.138524  0.729861
1  0.036632  0.372006
2  1.180648  1.291876
3 -1.895196  0.627503
4 -0.276614 -0.268332
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [30]:
df.groupby('key1')['data1']

In [31]:
df.groupby('key1')['data2']

In [32]:
df['data1'].groupby(df['key1'])

In [33]:
df['data2'].groupby(df['key1'])

In [34]:
df.groupby(['key1','key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.230764
     two   0.372006
b    one   1.291876
     two   0.627503

In [35]:
s_grouped=df.groupby(['key1','key2'])['data2']

In [36]:
s_grouped

In [37]:
s_grouped.mean()

key1  key2
a     one     0.230764
      two     0.372006
b     one     1.291876
      two     0.627503
Name: data2, dtype: float64

In [38]:
people=pd.DataFrame(np.random.randn(5,5),columns=['a','b','c','d','e'],
                   index=['Joe','Steve','Wes','Jim','Travis'])

In [39]:
people.iloc[2:3,[1,2]]=np.nan

In [40]:
people

               a         b         c         d         e
Joe    -0.143235 -0.569481 -2.304164 -1.116489 -0.694483
Steve  -1.926208 -1.189578  1.495574  0.388671 -2.120841
Wes     0.025515       NaN       NaN -0.078992 -0.369363
Jim     0.398120 -2.423141  1.733479  1.484297  0.182047
Travis -1.231483 -0.537709  0.376393 -0.720341  0.723323

In [41]:
mapping={'a':'red','b':'red','c':'blue','d':'blue','e':'red','f':'orange'}

In [42]:
by_columns=people.groupby(mapping,axis=1)

In [43]:
by_columns.sum()

            blue       red
Joe    -3.420653 -1.407199
Steve   1.884245 -5.236627
Wes    -0.078992 -0.343848
Jim     3.217776 -1.842973
Travis -0.343948 -1.045870

In [44]:
map_series=pd.Series(mapping)

In [45]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [46]:
people.groupby(map_series,axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [47]:
people.groupby(len).sum()

          a         b         c         d         e
3  0.280400 -2.992621 -0.570685  0.288816 -0.881798
5 -1.926208 -1.189578  1.495574  0.388671 -2.120841
6 -1.231483 -0.537709  0.376393 -0.720341  0.723323

In [48]:
key_list=['one','one','one','two','two']

In [49]:
people.groupby([len,key_list]).min()

              a         b         c         d         e
3 one -0.143235 -0.569481 -2.304164 -1.116489 -0.694483
  two  0.398120 -2.423141  1.733479  1.484297  0.182047
5 one -1.926208 -1.189578  1.495574  0.388671 -2.120841
6 two -1.231483 -0.537709  0.376393 -0.720341  0.723323

In [50]:
columns=pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],[1,3,5,1,3]],
                                 names=['cty','tenor'])

In [51]:
hier_df=pd.DataFrame(np.random.randn(4,5),columns=columns)

In [52]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.801292  0.445724 -0.351623 -1.219725 -1.265682
1     -1.342524  0.422005  0.904898 -1.074150  1.338876
2      0.551438  0.216659 -0.001075 -1.186617  1.012750
3     -1.046164 -0.744006  0.012365  1.282983  0.110263

In [53]:
hier_df.groupby(level='cty',axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [54]:
df

  key1 key2     data1     data2
0    a  one  2.138524  0.729861
1    a  two  0.036632  0.372006
2    b  one  1.180648  1.291876
3    b  two -1.895196  0.627503
4    a  one -0.276614 -0.268332

In [55]:
grouped=df.groupby('key1')

In [59]:
grouped['data1'].quantile(0.9)

key1
a    1.718146
b    0.873064
Name: data1, dtype: float64

In [60]:
def peak_to_peak(arr):
    return arr.max()-arr.min()

In [61]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     2.415138  0.998193
b     3.075844  0.664373

In [62]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.632847  1.313327 -0.276614 -0.119991  0.036632  1.087578
b      2.0 -0.357274  2.174950 -1.895196 -1.126235 -0.357274  0.411687

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     2.138524   3.0  0.277845  0.505714 -0.268332  0.051837  0.372006
b     1.180648   2.0  0.959689  0.469783  0.627503  0.793596  0.959689


           75%       max
key1
a     0.550933  0.729861
b     1.125783  1.291876

In [63]:
tips=pd.read_csv(r'examples_data_for_data_analysis\tips.csv')

In [65]:
tips['tip_pct']=tips['tip']/tips['total_bill']

In [66]:
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [67]:
grouped=tips.groupby(['day','smoker'])

In [69]:
grouped_pct=grouped['tip_pct']

In [70]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [72]:
grouped_pct.agg(['mean','std',peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [74]:
grouped_pct.agg([('foo','mean'),('bar',np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [75]:
grouped.agg({'tip':np.max,'size':'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [76]:
grouped.agg({'tip_pct':['min','max','mean','std'],'size':'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

In [78]:
tips.groupby(['day','smoker'],as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

In [79]:
def top(df,n=5,columns='tip_pct'):
    return df.sort_values(by=columns)[-n:]

In [80]:
top(tips,n=6)

     total_bill   tip smoker  day    time  size   tip_pct
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39     No  Sat  Dinner     2  0.291990
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345

In [81]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [82]:
tips.groupby(['smoker','day']).apply(top,n=1,columns='total_bill')

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [83]:
result=tips.groupby('smoker')['tip_pct'].describe()

In [84]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [85]:
result.unstack('smoker')

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [86]:
frames=pd.DataFrame({'data1':np.random.randn(1000),
                    'data2':np.random.randn(1000)})

In [89]:
quartiles=pd.cut(frames.data1,4)

In [90]:
quartiles[:10]

0    (-1.158, 0.338]
1    (-1.158, 0.338]
2     (0.338, 1.835]
3    (-1.158, 0.338]
4    (-1.158, 0.338]
5    (-1.158, 0.338]
6    (-1.158, 0.338]
7    (-1.158, 0.338]
8    (-1.158, 0.338]
9    (-1.158, 0.338]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-2.661, -1.158] < (-1.158, 0.338] < (0.338, 1.835] < (1.835, 3.332]]

In [91]:
def get_stats(group):
    return {'min':group.min(),'max':group.max(),
           'count':group.count(),'mean':group.mean()}

In [93]:
grouped=frames.data2.groupby(quartiles)

In [94]:
grouped.apply(get_stats).unstack()

                  count       max      mean       min
data1
(-2.661, -1.158]  143.0  3.029194 -0.120765 -2.846805
(-1.158, 0.338]   505.0  3.281122 -0.008877 -2.844264
(0.338, 1.835]    317.0  3.889575  0.007243 -2.943199
(1.835, 3.332]     35.0  1.812210 -0.107818 -1.749131

In [95]:
grouping=pd.cut(frames.data1,10,labels=False)

In [97]:
grouped=frames.data2.groupby(grouping)

In [99]:
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0       20.0  1.345656 -0.004995 -1.478782
1       63.0  3.029194 -0.298792 -2.846805
2      131.0  3.281122 -0.027734 -2.347867
3      194.0  2.388512  0.032578 -2.056940
4      240.0  2.593191 -0.022981 -2.844264
5      189.0  3.889575  0.045850 -2.457600
6      107.0  2.358377 -0.020276 -2.943199
7       41.0  1.812210 -0.079443 -2.016271
8       12.0  1.538027 -0.137137 -1.435270
9        3.0  0.072835 -1.023722 -1.749131

In [100]:
s=pd.Series(np.random.randn(6))

In [101]:
s[::2]=np.nan

In [102]:
s.fillna(s.mean())

0    0.544776
1    0.475498
2    0.544776
3    0.821592
4    0.544776
5    0.337236
dtype: float64

In [103]:
states=['Ohio', 'New York', 'Vermont', 'Florida',
....: 'Oregon', 'Nevada', 'California', 'Idaho']

In [104]:
group_key=['East']*4+['West']*4

In [106]:
data=pd.Series(np.random.randn(8),index=states)

In [107]:
data

Ohio          0.770433
New York      1.735255
Vermont       2.663190
Florida       1.714191
Oregon       -0.845746
Nevada       -0.692973
California   -0.925844
Idaho        -0.398534
dtype: float64

In [108]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan

In [109]:
data

Ohio          0.770433
New York      1.735255
Vermont            NaN
Florida       1.714191
Oregon       -0.845746
Nevada             NaN
California   -0.925844
Idaho              NaN
dtype: float64

In [110]:
data.groupby(group_key).mean()

East    1.406626
West   -0.885795
dtype: float64

In [111]:
fill_mean = lambda g: g.fillna(g.mean())

In [112]:
data.groupby(group_key).apply(fill_mean)

Ohio          0.770433
New York      1.735255
Vermont       1.406626
Florida       1.714191
Oregon       -0.845746
Nevada       -0.885795
California   -0.925844
Idaho        -0.885795
dtype: float64

In [113]:
fill_values = {'East': 0.5, 'West': -1}

In [114]:
fill_func = lambda g: g.fillna(fill_values[g.name])

In [115]:
data.groupby(group_key).apply(fill_func)

Ohio          0.770433
New York      1.735255
Vermont       0.500000
Florida       1.714191
Oregon       -0.845746
Nevada       -1.000000
California   -0.925844
Idaho        -1.000000
dtype: float64